src/cf/DataProcessors/ор_ЗагрузкаДанныхИзТабличногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_ЗагрузкаДанныхИзТабличногоДокумента</Name>
			<Comment>Загрузка данных из табличного документа</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТаблицаЗагружаемыхРеквизитов</Name>
					<Comment>Таблица загружаемых реквизитов</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретСозданияНовыхЭлементов</Name>
					<Comment>Флаг Не создавать новых элементов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяНумерацияКолонокТабличногоДокумента</Name>
					<Comment>Ручная нумерация колонок табличного документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрокаДанныхТабличногоДокумента</Name>
					<Comment>Первая строка данных табличного документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗагрузки</Name>
					<Comment>Режим загрузки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаИсточника</Name>
					<Comment>Ссылка источника</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧастьИсточника</Name>
					<Comment>Табличная часть источника</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧастьДокументаОбъекта</Name>
					<Comment>Табличная часть документа объекта</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередЗаписьюОбъекта</Name>
					<Comment>Перед записью объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриЗаписиОбъекта</Name>
					<Comment>При записи объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПослеДобавленияСтроки</Name>
					<Comment>После добавления строки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВидаРегистра</Name>
					<Comment>Имя вида регистра</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамещатьСуществующиеЗаписи</Name>
					<Comment>Замещать существующие записи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧастьОбъекта</Name>
					<Comment>Табличная часть объекта</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флПоискПоПрайсуПоставщика</Name>
					<Comment>Поиск по прайсу поставщика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогАрхиваЗагруженныхФайлов</Name>
					<Comment>Каталог архива загруженных файлов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеСЗагружаемымФайлом</Name>
					<Comment>Действие с загружаемым файлом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСправочника</Name>
					<Comment>Имя справочника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОбновленияСуществующихЭлементов</Name>
					<Comment>Флаг Не обновлять существующие элементы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Табуляция</Name>
					<Comment>Разделитель между колонками для текстовых документов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаФормироватьНовыеСерии</Name>
					<Comment>Всегда формировать новые серии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаДополнительныхПараметров</Name>
					<Comment>Таблица дополнительных параметров</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматДатыСрокаГодности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПроизводителя</Name>
					<Comment>Создавать производителя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВнешнийМодульПреобразованияФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФормироватьДопНомерСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаПреобразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличныйДокумент</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьШК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧДокумента</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбъект</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДополнительныеРеквизитыИСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеРеквизитыИСведенияТолькоОбщие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеРеквизитыПоКатегорииНоменклатуры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаЗагружаемыхРеквизитовШапки</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяНумерацияКолонокТабличногоДокументаДляШапки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрокаДанныхШапки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШКЯвляетсяПолемПоискаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьШКДляНовойНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьШКДляНовойХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНеОбрабатываемыхСтрок</Name>
					<Comment>Последняя строка данных табличного документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьОбщиеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьСтрануПроисхождения</Name>
					<Comment>Создавать страну происхождения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьGTINДляСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСтавкиНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенийБольшеОдного</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизводительЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ор_ЗагрузкаДанныхИзТабличногоДокумента/Forms/ФормаПодбораНоменклатурыПоСхожести/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого СтрокаКоллекции Из Параметры.КоллекцияСтрок Цикл 
		Если НЕ ЗначениеЗаполнено(СтрокаКоллекции.Номенклатура) Тогда
			НоваяСтрока = ТаблицаСоответствий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
			НоваяСтрока.Загружать = Истина;
		КонецЕсли;
	КонецЦикла;
	
	СоответствияПодобраны = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДоступностьюГруппаПоискПоСловам();
	УправлениеДоступностьюГруппаЧисловыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СоответствияПодобраны Тогда
		
		Если ЗавершениеРаботы Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Отказ = Истина;
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Выполнить перенос соответствий?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользованиеКлючевогоСловаПриИзменении(Элемент)
	
	УправлениеДоступностьюГруппаПоискПоСловам();
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЧисловымЗначениямПриИзменении(Элемент)
	
	УправлениеДоступностьюГруппаЧисловыеЗначения();
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКлючевогоСловаПриИзменении(Элемент)
	
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбязательноеНаличиеКлючевогоСловаПриИзменении(Элемент)
	
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИЛИПриИзменении(Элемент)
	
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствийПриАктивизацииСтроки(Элемент)
	
	ЗаполнитьВарианты();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрокаТаблицыСоответствий = Элементы.ТаблицаСоответствий.ТекущиеДанные;
	Если ТекущаяСтрокаТаблицыСоответствий = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаТаблицыСоответствий.Номенклатура = ТаблицаНоменклатуры.НайтиПоИдентификатору(ВыбраннаяСтрока).Номенклатура;
	СоответствияПодобраны = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перенести(Команда)
	
	СоответствияПодобраны = Ложь;
	Закрыть(ТаблицаСоответствий);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСоответствий Цикл
		СтрокаТаблицы.Загружать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСоответствий Цикл
		СтрокаТаблицы.Загружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		СоответствияПодобраны = Ложь;
		Закрыть(ТаблицаСоответствий);
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		СоответствияПодобраны = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВарианты()
	
	ТекущаяСтрока = Элементы.ТаблицаСоответствий.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВариантыСервер(ТекущаяСтрока.Наименование);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантыСервер(НаименованиеНоменклатуры)
	
	СтрокаСловНаименования = СтрЗаменить(НаименованиеНоменклатуры,"."," "); // убрали точки
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,","," "); // убрали запятые
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"+"," "); // убрали дефисы
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"_"," "); // убрали подчёркивание
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"("," "); // убрали (
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,")"," "); // убрали )
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"№"," "); // убрали №
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"/"," "); // убрали /
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования,"\"," "); // убрали \
	
	СтрокаСловНаименования = СтрЗаменить(СтрокаСловНаименования," ", Символы.ПС); // разобьём на строки по словам
	
	// определимся с ключевым словом 
	УсловиеКлючевогоСлова = "";
	БылоИ = Ложь;
	Если ИспользованиеКлючевогоСлова Тогда
		Если СтрЧислоСтрок(СтрокаСловНаименования) >= НомерКлючевогоСлова Тогда
			
			КлючевоеСлово =  СокрЛП(СтрПолучитьСтроку(СтрокаСловНаименования,НомерКлючевогоСлова));
			ПозицияКавычки = Найти(КлючевоеСлово,"""");
			Если ПозицияКавычки <> 0 Тогда
				КлючевоеСлово = Лев(КлючевоеСлово,ПозицияКавычки-1);
			КонецЕсли;	
			УсловиеКлючевогоСлова = " И (Номенклатура.Наименование ПОДОБНО ""%"+КлючевоеСлово+"%"""; 
			БылоИ = Истина;
			Если ОбязательноеНаличиеКлючевогоСлова Тогда
				БылоИ = Ложь;
				УсловиеКлючевогоСлова = УсловиеКлючевогоСлова + ")";
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Наименование,
	|	Номенклатура.ор_Производитель КАК Производитель
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И НЕ Номенклатура.ПометкаУдаления"+
	УсловиеКлючевогоСлова;
	
	Если ИспользоватьИЛИ Тогда
		ИлиИ = "ИЛИ";
	Иначе
		ИлиИ = "И";
	КонецЕсли;
	
	Если ОтборПоЧисловымЗначениям Тогда
		Для Сч = 1 По СтрЧислоСтрок(СтрокаСловНаименования) Цикл
			ЧислоСтр = ВыделитьЧисло(СокрЛП(СтрПолучитьСтроку(СтрокаСловНаименования,Сч)));
			Если ЧислоСтр <> "" Тогда
				ТекстЗапроса =ТекстЗапроса + ?(БылоИ," "+ИлиИ+" "," И (")+"Номенклатура.Наименование ПОДОБНО ""%"+ЧислоСтр+"%"""; 
				БылоИ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если БылоИ Тогда
		ТекстЗапроса = ТекстЗапроса + ")";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаНоменклатуры.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыделитьЧисло(Знач Стр)
	
	ВозвСтр="";
	Стр=СокрЛП(Стр);
	
	Для Сч=1 По СтрДлина(Стр) Цикл
		ВозвСтр=ВозвСтр+?(Найти("1234567890",Сред(Стр,Сч,1))=0,"",Сред(Стр,Сч,1));
	КонецЦикла;
	
	Возврат ВозвСтр;
	
КонецФункции

&НаКлиенте
Процедура УправлениеДоступностьюГруппаПоискПоСловам()
	
	Элементы.НомерКлючевогоСлова.Доступность               = ИспользованиеКлючевогоСлова;
	Элементы.ОбязательноеНаличиеКлючевогоСлова.Доступность = ИспользованиеКлючевогоСлова;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюГруппаЧисловыеЗначения()
	
	Элементы.ИспользоватьИЛИ.Доступность = ОтборПоЧисловымЗначениям;
	
КонецПроцедуры

#КонецОбласти
